{
  "profile": {
    "title": { "type": "text", "content": "JIUK KIM" },
    "subtitle": "Software Engineer",
    "description": "I aspire to be an engineer who creates tangible business impact by connecting data and AI. I focus on system design that balances both stability and performance in real-time traffic environments, while continuously learning relevant technologies and applying them to projects. Grounded in business administration domain knowledge, I am growing as an AI backend and data engineer who prioritizes data quality and reliability.",
    "items": [
      { "type": "text", "content": "{{personal.contact.email}}" },
      { "type": "text", "content": "{{personal.contact.linkedin}}" },
      { "type": "text", "content": "{{personal.contact.github}}" }
    ]
  },
  "sections": {
    "skillsSummary": {
      "title": { "type": "text", "content": "Skills Summary" },
      "content": [
        {
          "type": "card",
          "title": {
            "type": "text",
            "content": "AI Engineering"
          },
          "content": [
            {
              "type": "text",
              "content": "Experience developing features using LLM or vector search in real-time traffic environments, leading projects."
            },
            {
              "type": "text",
              "content": "Implemented agent-based automation services and internal PoCs using LangChain and LangGraph."
            },
            {
              "type": "text",
              "content": "Implemented MCP servers for external API integration and RAG systems, internal PoCs."
            },
            {
              "type": "text",
              "content": "Experience with machine learning lifecycle (data processing, training, monitoring, optimization) using MLflow and similar tools."
            },
            {
              "type": "text",
              "content": "Experience with QLoRA fine-tuning and LLM model serving using vLLM, Triton, etc. in side projects."
            }
          ]
        },
        {
          "type": "card",
          "title": { "type": "text", "content": "Software Development" },
          "content": [
            {
              "type": "text",
              "content": "Experience leading individual and collaborative projects, with multiple competition awards."
            },
            {
              "type": "text",
              "content": "Capable of independently developing simple frontend applications with React.js and Next.js."
            },
            {
              "type": "text",
              "content": "Experience with backend development and handling traffic environments using Go and TypeScript."
            },
            {
              "type": "text",
              "content": "Experience with schema design and database usage based on SQL, NoSQL, Redis, and GraphQL."
            },
            {
              "type": "text",
              "content": "Experience with service deployment and monitoring in Kafka, Docker, AWS, and ArgoCD environments."
            }
          ]
        }
      ]
    },
    "experience": {
      "title": { "type": "text", "content": "Experience" },
      "content": [
        {
          "type": "card",
          "variant": "simple",
          "title": { "type": "text", "content": "Karrot Inc." },
          "description": "Jan 2025 – Present",
          "content": [
            {
              "type": "card",
              "subtitle": "Full-time (Converted from Internship) • Software Engineer, Backend • Karrot Chat Team",
              "variant": "timeline",
              "content": [
                {
                  "type": "text",
                  "content": "Go chapter, domain-driven design and gRPC-based distributed systems experience"
                },
                {
                  "type": "text",
                  "content": "✓ Project 1. Chat Auto-translation: Real-time traffic handling and LLM pipeline separation"
                },
                {
                  "type": "text",
                  "content": "✓ Project 2. Managed Template Messaging Improvement: Data flow and visibility enhancement"
                },
                {
                  "type": "text",
                  "content": "✓ Project 3. Semantic Caching Implementation: 25% annual LLM cost reduction via vector search"
                },
                {
                  "type": "text",
                  "content": "✓ Project 4. LangGraph-based Prompt Evaluation and Improvement Automation Agent PoC"
                },
                {
                  "type": "text",
                  "content": "✓ Project 5. SHAP-based Churn Prediction Modeling PoC by Chat Session"
                }
              ]
            }
          ]
        },
        {
          "type": "card",
          "variant": "simple",
          "title": { "type": "text", "content": "U.S. 8th Army Headquarters Battalion" },
          "description": "Jul 2023 – Dec 2024",
          "content": [
            {
              "type": "card",
              "variant": "timeline",
              "subtitle": "Military Service • Discharged as Sergeant, KATUSA, Republic of Korea Army",
              "content": [
                {
                  "type": "text",
                  "content": "Database design and visualization of KATUSA personnel information for U.S. Forces Korea"
                },
                {
                  "type": "text",
                  "content": "✓ Completed Google Machine Learning Bootcamp 2024 (5th cohort), Naver Connect Foundation Coaching Study 13th cohort."
                },
                {
                  "type": "text",
                  "content": "✓ Developed and operated a web app providing U.S. Forces Korea holiday information (MAU 1,200+)."
                }
              ]
            }
          ]
        }
      ]
    },
    "projects": {
      "title": { "type": "text", "content": "Projects" },
      "content": [
        {
          "type": "card",
          "variant": "simple",
          "title": {
            "type": "text",
            "content": "Managed Message Template Feature Improvement: Data Structure and Operational Visibility Enhancement"
          },
          "highlights": ["Data structure improvement", "Operational visibility enhancement", "Automated sending log tagging", "Monitoring dashboard construction"],
          "content": [
            {
              "type": "card",
              "subtitle": "Why",
              "variant": "timeline",
              "content": [
                {
                  "type": "text",
                  "content": "Managed messages are a template-based messaging feature that allows pre-registering message content as templates for easy sending later."
                },
                {
                  "type": "text",
                  "content": "However, the existing implementation had limited functionality with poor scalability, and tracking sending status was difficult, making it hard to understand overall operational status."
                },
                {
                  "type": "text",
                  "content": "To improve the feature's completeness and ensure operational stability, improving the data structure and establishing a standardized system to track sending status was necessary."
                }
              ]
            },
            {
              "type": "card",
              "variant": "timeline",
              "subtitle": "How",
              "content": [
                {
                  "type": "text",
                  "content": "Modified message template data structure and improved pipeline to support more message types."
                },
                {
                  "type": "text",
                  "content": "Automatically added standardized tags by utilizing request metadata during message sending."
                },
                {
                  "type": "text",
                  "content": "Implemented dashboard to monitor sending status across various dimensions."
                }
              ]
            },
            {
              "type": "card",
              "subtitle": "What",
              "variant": "timeline",
              "content": [
                {
                  "type": "text",
                  "content": "Improved the completeness of the managed message feature, and enhanced the data collection and analysis system to flow from metadata collection, tag storage, to visualization, securing operational visibility."
                }
              ]
            }
          ]
        },
        {
          "type": "card",
          "variant": "simple",
          "title": {
            "type": "text",
            "content": "Semantic Caching Implementation: 25% Annual LLM Cost Reduction via Vector Search"
          },
          "highlights": ["Intern-led proposal", "Vector search", "Embedded vector DB usage", "P95 <1s", "TPS 200/instance"],
          "link": {
            "text": "Read post",
            "url": "https://medium.com/p/af3de9a74d0c"
          },
          "content": [
            {
              "type": "card",
              "subtitle": "Why",
              "variant": "timeline",
              "content": [
                {
                  "type": "text",
                  "content": "We introduced a feature that uses LLM to recommend chat utterances for user experience."
                },
                {
                  "type": "text",
                  "content": "However, frequent LLM calls were projected to cost approximately ₩900M annually."
                },
                {
                  "type": "text",
                  "content": "We needed a way to reduce costs while maintaining a similar user experience."
                }
              ]
            },
            {
              "type": "card",
              "variant": "timeline",
              "subtitle": "How",
              "content": [
                {
                  "type": "text",
                  "content": "As an intern at the time, I proactively proposed semantic caching techniques using real-time vector search."
                },
                {
                  "type": "text",
                  "content": "Embedded real chat data and identified semantic conversation pattern clusters using PCA and HDBSCAN."
                },
                {
                  "type": "text",
                  "content": "Used an add-on structure separated from the main server with embedded vector DB to prevent external traffic migration."
                },
                {
                  "type": "text",
                  "content": "Load testing identified network I/O bottlenecks, addressed with lightweight multi-replica configuration for concurrency handling."
                }
              ]
            },
            {
              "type": "card",
              "subtitle": "What",
              "variant": "timeline",
              "content": [
                {
                  "type": "text",
                  "content": "Semantic caching techniques were applied to 13 frequently appearing utterance meaning clusters in chat, enabling expected cost savings of 25%, over ₩230M annually in LLM call costs."
                }
              ]
            }
          ]
        },
        {
          "type": "card",
          "variant": "simple",
          "title": {
            "type": "text",
            "content": "LangGraph-based Prompt Evaluation and Improvement Automation Agent PoC"
          },
          "highlights": ["Multi-turn agent", "Persona scenarios", "Automated evaluation-improvement loop", "Operational-ready prompt management system"],
          "link": {
            "text": "Read post",
            "url": "https://medium.com/p/7630ca814b0c"
          },
          "content": [
            {
              "type": "card",
              "subtitle": "Why",
              "variant": "timeline",
              "content": [
                {
                  "type": "text",
                  "content": "When designing LLM services, it's important to write prompts optimized for the intended purpose."
                },
                {
                  "type": "text",
                  "content": "However, evaluating prompt quality is difficult to quantify with consistent criteria due to natural language characteristics, resulting in time-consuming and costly trial-and-error-based gradual improvements."
                },
                {
                  "type": "text",
                  "content": "An automation agent was needed to evaluate prompt quality with appropriate criteria across various situations and suggest improvements."
                }
              ]
            },
            {
              "type": "card",
              "subtitle": "How",
              "variant": "timeline",
              "content": [
                {
                  "type": "text",
                  "content": "Connected three sub-graphs with LangGraph, receiving system prompts from users and designing an automated evaluation-improvement loop."
                },
                {
                  "type": "text",
                  "content": "Planner graph dynamically extracts evaluation criteria from the input prompt and defines test scope by generating multiple personas and scenarios appropriate for the situation."
                },
                {
                  "type": "text",
                  "content": "Actor graph simulates virtual requests in parallel based on generated personas and scenarios, generates responses, and automatically produces scores and feedback according to derived criteria."
                },
                {
                  "type": "text",
                  "content": "Reflector graph determines improvement needs from evaluation results, rewrites prompts when necessary, and implements operational-level continuous improvement by incorporating human feedback loops."
                }
              ]
            },
            {
              "type": "card",
              "subtitle": "WHAT",
              "variant": "timeline",
              "content": [
                {
                  "type": "text",
                  "content": "Confirmed improvement effects through cross-validation between commercial LLM services and verified the feasibility of implementing a repeatable automation loop for evaluating and improving system prompts across various scenarios."
                },
                {
                  "type": "text",
                  "content": "Also explored the possibility of expanding beyond one-time prompt usage into a prompt management infrastructure capable of continuous operation and maintenance."
                }
              ]
            }
          ]
        },
        {
          "type": "card",
          "variant": "simple",
          "title": {
            "type": "text",
            "content": "SHAP-based Explainable Churn Probability Prediction Modeling by Chat Session PoC"
          },
          "highlights": ["Language + behavioral signal integrated learning", "SHAP-based interpretability", "Churn probability-based response strategy discovery"],
          "content": [
            {
              "type": "card",
              "subtitle": "Why",
              "variant": "timeline",
              "content": [
                {
                  "type": "text",
                  "content": "Chat data is the area where the richest user interactions occur within the service, containing important insights to understand user experience and service issues."
                },
                {
                  "type": "text",
                  "content": "However, chat data includes not only simple text but also time-series language and behavioral patterns, making it difficult for existing simple churn prediction models to clearly understand when and by what signals users churn."
                },
                {
                  "type": "text",
                  "content": "Therefore, we needed a model that could precisely estimate churn probability by chat session and interpret the causes based on SHAP, and proceeded with a PoC to validate this."
                }
              ]
            },
            {
              "type": "card",
              "variant": "timeline",
              "subtitle": "How",
              "content": [
                {
                  "type": "text",
                  "content": "Generated text embeddings with BERT/DistilBERT and extracted key language signals such as sentiment, politeness, and closing intent, structuring them as features."
                },
                {
                  "type": "text",
                  "content": "Combined conversation metadata such as response time, message length, and reaction presence to build a feature engineering pipeline reflecting time-series flow."
                },
                {
                  "type": "text",
                  "content": "Initially examined Transformer-based sequence encoders, but considering model size, inference speed, and operational difficulty, ultimately selected a LightGBM-based model to enable near real-time processing."
                },
                {
                  "type": "text",
                  "content": "Used SHAP to analyze each feature's contribution, creating an interpretable structure for real-time monitoring of why the model predicted high churn probability at specific points."
                }
              ]
            },
            {
              "type": "card",
              "subtitle": "What",
              "variant": "timeline",
              "content": [
                {
                  "type": "text",
                  "content": "Achieved rapid churn probability calculation at each chat progress point with a lightweight feature engineering + LightGBM-based model, enabling interpretable results in near real-time."
                },
                {
                  "type": "text",
                  "content": "Based on this interpretation, explored the possibility of early detection of risk signals and establishing actionable intervention hypotheses."
                }
              ]
            }
          ]
        }
      ]
    },
    "education": {
      "title": { "type": "text", "content": "Education" },
      "content": [
        {
          "type": "card",
          "title": {
            "type": "text",
            "content": "Georgia Institute of Technology"
          },
          "level": "secondary",
          "tag": "Aug 2024 – 2026",
          "subtitle": "M.S. in Computer Science (OMSCS), In Progress",
          "content": [
            {
              "type": "text",
              "level": "secondary",
              "content": "Specializing in Machine Learning"
            }
          ]
        },
        {
          "type": "card",
          "level": "secondary",
          "title": { "type": "text", "content": "Korea University" },
          "subtitle": "B.A. in Business Administration, Graduated",
          "tag": "Mar 2017 – Feb 2024",
          "content": [
            {
              "type": "text",
              "level": "secondary",
              "content": "Completed Business Analytics track"
            },
            {
              "type": "text",
              "level": "secondary",
              "content": "Founded undergraduate Business Analytics association"
            },
            {
              "type": "text",
              "level": "secondary",
              "content": "Software Startup Association NEXT (LikeLion)"
            }
          ]
        }
      ]
    },
    "awards": {
      "title": { "type": "text", "content": "Awards" },
      "content": [
        {
          "type": "card",
          "level": "secondary",
          "title": { "type": "text", "content": "1st Defense AI Ideathon" },
          "tag": "2024",
          "content": [
            {
              "type": "text",
              "level": "secondary",
              "content": "Excellence Award (Army Chief of Staff Award)"
            }
          ]
        },
        {
          "type": "card",
          "level": "secondary",
          "title": { "type": "text", "content": "11th Army Startup Competition" },
          "tag": "2024",
          "content": [
            {
              "type": "text",
              "level": "secondary",
              "content": "Excellence Award (Daejeon Employment and Economy Promotion Agency Award)"
            }
          ]
        },
        {
          "type": "card",
          "level": "secondary",
          "title": {
            "type": "text",
            "content": "Jeju Satellite Data Utilization Contest"
          },
          "tag": "2023",
          "content": [
            {
              "type": "text",
              "level": "secondary",
              "content": "Grand Prize (Jeju Special Self-Governing Province Governor's Award)"
            }
          ]
        }
      ]
    },
    "languages": {
      "title": { "type": "text", "content": "Languages" },
      "content": [
        {
          "type": "card",
          "level": "secondary",
          "title": { "type": "text", "content": "Korean" },
          "tag": "Native"
        },
        {
          "type": "card",
          "level": "secondary",
          "title": { "type": "text", "content": "English" },
          "tag": "Advanced",
          "content": [
            {
              "type": "text",
              "level": "secondary",
              "content": "TOEIC: 915/990"
            },
            {
              "type": "text",
              "level": "secondary",
              "content": "TOEIC Speaking: 150/200"
            },
            {
              "type": "text",
              "level": "secondary",
              "content": "TOEFL: 92/120"
            }
          ]
        },
        {
          "type": "card",
          "level": "secondary",
          "title": { "type": "text", "content": "Japanese" },
          "tag": "Beginner"
        }
      ]
    },
    "certifications": {
      "title": { "type": "text", "content": "Certifications" },
      "content": [
        {
          "type": "card",
          "level": "secondary",
          "title": { "type": "text", "content": "Information Processing Engineer (Written)" },
          "tag": "2024.03"
        },
        {
          "type": "card",
          "level": "secondary",
          "title": { "type": "text", "content": "Big Data Analysis Engineer" },
          "tag": "2024.06"
        },
        {
          "type": "card",
          "level": "secondary",
          "title": { "type": "text", "content": "Certified Management Accountant (Korea)" },
          "tag": "2021.11"
        }
      ]
    },
    "skills": {
      "title": { "type": "text", "content": "Technical Skills" },
      "content": [
        {
          "type": "list",
          "content": [
            { "type": "text", "content": "Python" },
            { "type": "text", "content": "Go" },
            { "type": "text", "content": "TypeScript" },
            { "type": "text", "content": "Kotlin" },
            { "type": "text", "content": "Java" }
          ]
        }
      ]
    }
  }
}
